Tekla.Structures.ModelInternal.Operation.EditMacro(System.String,Tekla.Structures.ModelInternal.Operation.MacroLocationEnum)
Edit an existing macro.
fileName:
The file name. (file Name specifies modeling or drawing / file name
and is relative to the XS_MACRO_DIRECTORY path specified for local or global macros) or is an absolute path to the macro
macroLocation:
The macro Location enumeration, global, local or absolute.
Returns:
Returns false if no file exists

Tekla.Structures.ModelInternal.Operation.StartMacroRecording(System.String,Tekla.Structures.ModelInternal.Operation.MacroLocationEnum)
Start a macro recording.
fileName:
The file name. fileName is relative to either the XS_MACRO_DIRECTORY global or local directories or is the absolute
path to the macro .cs file
macroLocation:
The macro Location enumeration.
Returns:
Returns false if the macro is already recording or running, the file already exists or the directory is read only

Tekla.Structures.ModelInternal.Operation.IsMacroRecording
Checks whether a macro is currently recording
Returns:
Returns true if recording, false if not

Tekla.Structures.ModelInternal.Operation.StopMacroRecording
Stops the currently recording macro
Returns:
Returns false if macro is not currently recording

Tekla.Structures.ModelInternal.Operation.RefreshMacroList
Refresh the list of macros
Returns:
Currently just returns true

Tekla.Structures.ModelInternal.Operation.dotSharingSaveVersionGuid(System.Guid)


Tekla.Structures.ModelInternal.Operation.dotSharingWriteOut(System.String,Tekla.Structures.ModelInternal.Operation.DotSharingWriteOutModeEnum,System.String,Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum@,System.String@,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@)
The dot sharing write out.
packetFolder: Full path to the folder that contains all the files that will be included in the write out file.
mode: The write out mode.
revisionInfo:
The revision information as xml.
My comment
My code
myemail@tekla.com
My Name
errorCode: The Error Code in case the write-out failed.
errorDetail: Detail for the error
moduleBaselines: The module baselines, tuples of old baseline and new baseline.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.Operation.dotSharingWriteOutCommit(System.Boolean,System.String,System.Int32,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@)
The dot sharing write out commit.
success: True if write out was successful so commit to be done, if false uncommit to be done.
packetFolder: Full path to the folder that contains all the files that will be included in the write out file.
packetNumber: The packet number.
moduleBaselines: The module baselines, tuples of old baseline and new baseline.
Returns: Commit/uncommit result.

Tekla.Structures.ModelInternal.Operation.dotSharingReadInStarting(System.Boolean)


Tekla.Structures.ModelInternal.Operation.dotCleanDrawingFiles(System.Boolean,System.String)
Returns: